{
  "experiences": [
    {
      "company": "IBM",
      "logo": "ibm_logo.png",
      "title": "AI Engineer - Critical National Infrastructure Program",
      "employmentType": "Contract",
      "startDate": "2024",
      "endDate": "Present",
      "duration": "1 yr",
      "location": "United Kingdom",
      "description": "AI Engineer - Intelligent Automation & LLM Integration. Developed AI-powered SRE process automation using LLMs (GPT-4, Claude) for intelligent decision-making. Implemented RAG (Retrieval Augmented Generation) system with vector embeddings for knowledge base queries. Built ML-powered monitoring and anomaly detection system reducing incident response time by 40%. Integrated Azure OpenAI APIs for natural language processing of system logs and alerts. Deployed containerized ML models using Kubernetes for scalable inference. Created automated prompt engineering pipeline for LLM optimization.",
      "skills": [
        "Python",
        "TensorFlow",
        "PyTorch",
        "Azure OpenAI (GPT-4)",
        "Claude API",
        "LangChain",
        "LlamaIndex",
        "Vector Databases (Pinecone, ChromaDB)",
        "Kubernetes",
        "Docker",
        "Azure ML",
        "MLflow",
        "SQL Server / PostgreSQL",
        "Azure DevOps"
      ]
    },
    {
      "company": "Goldman Sachs",
      "logo": "goldman_sachs_logo.png",
      "title": "ML Engineer - Financial Predictive Analytics",
      "employmentType": "Contract",
      "startDate": "2023",
      "endDate": "2023",
      "duration": "1 yr",
      "location": "Muscat, Oman",
      "description": "ML Engineer - Financial Predictive Analytics. Built predictive ML models for financial risk assessment using ensemble methods (XGBoost, Random Forest). Developed real-time anomaly detection system using LSTM neural networks for transaction monitoring. Implemented automated feature engineering pipeline reducing model development time by 60%. Created ML-powered data classification system achieving 95% accuracy. Deployed models to production using MLflow and AWS SageMaker. Optimized model inference time by 50% through model quantization and optimization.",
      "skills": [
        "Python",
        "TensorFlow",
        "PyTorch",
        "Scikit-learn",
        "AWS SageMaker",
        "MLflow",
        "SQL Server",
        "Data Analytics",
        "REST APIs for ML services",
        "Jupyter Notebooks",
        "JSON/XML data processing"
      ]
    },
    {
      "company": "Ypsomed",
      "logo": "ypsomed_logo.png",
      "title": "AI/IoT Engineer - Smart Device Intelligence",
      "employmentType": "Contract",
      "startDate": "2022",
      "endDate": "2022",
      "duration": "1 yr",
      "location": "Switzerland",
      "description": "AI/IoT Engineer - Smart Device Intelligence. Implemented edge AI models for IoT device intelligence using TensorFlow Lite. Developed ML pipeline for predictive maintenance reducing device failures by 35%. Built anomaly detection models for IoT sensor data with 92% accuracy. Deployed ML models to edge devices using containerization. Created data preprocessing pipeline for time-series IoT data. Improved system performance by 25% through model optimization.",
      "skills": [
        "Python",
        "TensorFlow Lite",
        "PyTorch Mobile",
        "IoT Platforms (Azure IoT, AWS IoT)",
        "Edge AI deployment",
        "Time-series analysis",
        "Git version control",
        "Model optimization & quantization"
      ]
    },
    {
      "company": "Cushman & Wakefield",
      "logo": "cushman_wakefield_logo.png",
      "title": "ML Data Engineer - AI Pipeline Development",
      "employmentType": "Contract",
      "startDate": "2021",
      "endDate": "2021",
      "duration": "1 yr",
      "location": "London, UK",
      "description": "ML Data Engineer - AI Pipeline Development. Built ML data pipelines using Databricks for automated feature engineering. Implemented automated data quality checks using ML-based anomaly detection. Created scalable ETL processes for training dataset preparation (10TB+ data). Integrated ML model training workflows with Apache Airflow. Increased data processing speed by 50% through PySpark optimization. Reduced data errors by 35% using automated validation and ML-powered data cleaning.",
      "skills": [
        "Databricks",
        "Apache Spark (PySpark)",
        "Python",
        "Pandas",
        "NumPy",
        "Apache Airflow for ML workflows",
        "ML feature stores",
        "SQL",
        "Data transformation",
        "Data validation & quality frameworks"
      ]
    },
    {
      "company": "Emerson",
      "logo": "emerson_logo.png",
      "title": "MLOps Engineer - GPU-Accelerated ML Infrastructure",
      "employmentType": "Contract",
      "startDate": "2020",
      "endDate": "2020",
      "duration": "1 yr",
      "location": "USA",
      "description": "MLOps Engineer - GPU-Accelerated ML Infrastructure. Deployed scalable Kubernetes clusters for ML workloads with GPU acceleration (NVIDIA A100). Built Docker containers for ML model serving with TensorFlow Serving and TorchServe. Implemented auto-scaling for ML inference reducing costs by 35%. Optimized GPU utilization for training deep learning models (CNNs, Transformers). Created CI/CD pipeline for automated model deployment and testing. Improved computational efficiency by 45% through distributed training strategies.",
      "skills": [
        "Kubernetes",
        "Docker",
        "NVIDIA GPU Computing (CUDA, cuDNN)",
        "TensorFlow Serving",
        "TorchServe",
        "MLflow",
        "Kubeflow",
        "Python",
        "Bash scripting",
        "Cloud Infrastructure (AWS, Azure)"
      ]
    },
    {
      "company": "Ardent Blue Technologies LLC",
      "logo": "ardent_blue_logo.png",
      "title": "AI/ML Engineer - Computer Vision for VR/AR",
      "employmentType": "Contract",
      "startDate": "2019",
      "endDate": "2019",
      "duration": "1 yr",
      "location": "USA",
      "description": "AI/ML Engineer - Computer Vision for VR/AR. Developed computer vision models for VR object recognition using CNNs (ResNet, EfficientNet). Built serverless ML inference pipeline using AWS Lambda for real-time predictions. Implemented automated model retraining pipeline reducing deployment time by 70%. Created pose estimation models for AR applications using MediaPipe. Optimized model inference for edge devices in VR headsets. Reduced operational costs by 40% through serverless architecture.",
      "skills": [
        "Python",
        "TensorFlow",
        "PyTorch",
        "Computer Vision (OpenCV, MediaPipe)",
        "AWS Lambda",
        "Serverless Framework",
        "Model optimization (ONNX, TensorRT)",
        "CI/CD for ML pipelines",
        "VR/AR platforms"
      ]
    },
    {
      "company": "Scottish Enterprise",
      "logo": "scottish_enterprise_logo.png",
      "title": "MLOps Engineer - Azure ML Pipeline Development",
      "employmentType": "Contract",
      "startDate": "2018",
      "endDate": "2018",
      "duration": "1 yr",
      "location": "Glasgow, UK",
      "description": "MLOps Engineer - Azure ML Pipeline Development. Established MLOps practices using Azure ML and continuous training pipelines. Integrated ML model monitoring with ELK Stack for performance tracking. Implemented automated model retraining based on data drift detection. Built logging and monitoring for ML model predictions and performance metrics. Improved system reliability by 35% through automated model validation. Created dashboards for ML model performance visualization.",
      "skills": [
        "Microsoft Azure (Azure ML, Azure DevOps)",
        "Python",
        "MLflow",
        "Azure ML SDK",
        "ELK Stack for ML monitoring",
        "Model drift detection tools",
        "Continuous training pipelines",
        "ML observability frameworks"
      ]
    },
    {
      "company": "Microsoft",
      "logo": "microsoft_logo.png",
      "title": "AI Strategy & Enterprise Transformation Architect",
      "employmentType": "Contract",
      "startDate": "2017",
      "endDate": "2017",
      "duration": "1 yr",
      "location": "USA",
      "description": "AI Strategy & Enterprise Transformation Architect. Led AI/ML adoption strategy for enterprise customers, increasing AI technology utilization by 50%. Architected AI-powered transformation solutions using Azure AI services. Implemented ML-driven business intelligence and predictive analytics. Conducted AI readiness assessments and roadmap development. Delivered AI/ML training and workshops to enterprise teams. Established best practices for responsible AI and ML governance.",
      "skills": [
        "Azure AI Services (Azure OpenAI, Cognitive Services)",
        "Cloud ML Platforms (Azure ML, AWS SageMaker)",
        "Python",
        "ML frameworks",
        "Enterprise Architecture Tools",
        "AI Strategy & Governance Frameworks"
      ]
    },
    {
      "company": "Accenture",
      "logo": "accenture_logo.png",
      "title": "ML Quality Assurance & Testing Lead",
      "employmentType": "Contract",
      "startDate": "2016",
      "endDate": "2016",
      "duration": "1 yr",
      "location": "USA",
      "description": "ML Quality Assurance & Testing Lead. Implemented ML model testing framework and quality metrics (accuracy, precision, recall, F1). Created automated testing pipeline for ML models using Great Expectations. Enhanced ML model quality by 30% through systematic testing and validation. Built data quality monitoring and alerting system. Implemented A/B testing framework for model performance comparison. Reduced model deployment time by 25% through automated validation.",
      "skills": [
        "Python",
        "pytest",
        "unittest",
        "ML testing frameworks (Great Expectations)",
        "SAFe methodology for ML teams",
        "Model validation tools",
        "A/B testing platforms",
        "Quality metrics tracking"
      ]
    },
    {
      "company": "RHIM",
      "logo": "rhim_logo.png",
      "title": "HPC Infrastructure Lead",
      "employmentType": "Contract",
      "startDate": "Aug 2023",
      "endDate": "Dec 2023",
      "duration": "5 mos",
      "location": "Remote Austrian Company",
      "description": "HPC Infrastructure Lead. Designed and implemented infrastructure as code setup for CUDA cluster in Azure specifically for machine learning workloads. Led the development of high-performance computing infrastructure optimized for AI/ML training and inference. Successfully deployed CUDA cluster infrastructure in Azure. Implemented Infrastructure as Code for HPC environments. Optimized machine learning workloads for distributed computing.",
      "skills": [
        "CUDA",
        "Azure",
        "Machine Learning",
        "Infrastructure as Code",
        "HPC Cluster Management",
        "DevOps",
        "Python",
        "Terraform",
        "Kubernetes"
      ]
    }
  ]
}
